app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["user_id", 1], ["created_at", "2020-06-10 17:14:53.477892"], ["updated_at", "2020-06-10 17:14:53.477892"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save